---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.FloorFailures
source: html/7db12ab0-596f-dff8-f834-bcfcb5c2df52.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FloorFailures

Failures related to floors and slabs.

## Syntax (C#)
```csharp
public static class FloorFailures
```